src/DataProcessors/ПанельАдминистрирования/ПанельАдминистрирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПанельАдминистрирования</name>
</mdclass:DataProcessor>

src/Enums/СостоянияПроектов/СостоянияПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияПроектов</name>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Корректировки</name>
  </enumValues>
</mdclass:Enum>

src/DataProcessors/ПанельАдминистрирования/Forms/КонтрагентыИИхПроекты/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПоказыватьЗавершенныеПриИзменении(Элемент)
	
	ИзменениеФлажкаПоказатьЗаверешенные();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСостояниеПроектов()
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.СостоянияПроектов.Согласован);
	СписокЗначений.Добавить(Перечисления.СостоянияПроектов.Корректировки);
	СписокЗначений.Добавить(Перечисления.СостоянияПроектов.ПустаяСсылка());
	Возврат СписокЗначений;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокКонтрагентов.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователи.АвторизованныйПользователь());
	СписокПроектов.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователи.АвторизованныйПользователь());
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтрагентовПриАктивизацииСтроки(Элемент)
	
	СписокПроектов.Параметры.УстановитьЗначениеПараметра("Контрагент", Элемент.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПоказыватьЗавершенные = Ложь;
	ЭлементОтбора = СписокПроектов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Состояние");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = ПолучитьСостояниеПроектов();
	ЭлементОтбора.Использование  = Ложь;
	ИзменениеФлажкаПоказатьЗаверешенные();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеФлажкаПоказатьЗаверешенные()
	
	ЭлементОтбора = СписокПроектов.Отбор.Элементы[0];
	Если ПоказыватьЗавершенные Тогда
		ЭлементОтбора.Использование = Ложь;
	Иначе
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти
